#+Title: LoginAppJava (Widgets Android Views)
#+Subtitle: Conhecendo e obtendo valores de Views (toasts)

** Revisando o que é uma activity
   Uma classe java e um xml
   Nossa activity consiste nos seguintes arquivos:
   
   Eis nossa classe java...
   #+NAME: ls projetos/LoginAppJava/app/src/main/java/eteczl/edu/br/loginappjava
   #+BEGIN_SRC shell :session s1 :results output :exports both
      #starts code
      ls projetos/LoginAppJava/app/src/main/java/eteczl/edu/br/loginappjava
   #+END_SRC

   #+RESULTS: ls projetos/LoginAppJava/app/src/main/java/eteczl/edu/br/loginappjava
   : 
   : MainActivity.java
   
   
   #+INCLUDE: projetos/LoginAppJava/app/src/main/java/eteczl/edu/br/loginappjava/MainActivity.java :src java


   E nosso xml
   Essa pasta res é importante, e tem a ver com a classe R
   Cada um dos diretórios tem sua importancia no projeto
      #+NAME: ls projetos/LoginAppJava/app/src/main/res/
   #+BEGIN_SRC shell :session s1 :results output :exports both
      #starts code
      ls -l projetos/LoginAppJava/app/src/main/res/
   #+END_SRC

   #+RESULTS: ls projetos/LoginAppJava/app/src/main/res/
   #+begin_example

   total 40
   drwxrwxr-x. 2 wagner wagner 4096 ago 11 22:05 drawable
   drwxrwxr-x. 2 wagner wagner 4096 ago 11 22:05 drawable-v24
   drwxrwxr-x. 2 wagner wagner 4096 ago 11 22:18 layout
   drwxrwxr-x. 2 wagner wagner 4096 ago 11 22:05 mipmap-anydpi-v26
   drwxrwxr-x. 2 wagner wagner 4096 ago 11 22:04 mipmap-hdpi
   drwxrwxr-x. 2 wagner wagner 4096 ago 11 22:04 mipmap-mdpi
   drwxrwxr-x. 2 wagner wagner 4096 ago 11 22:04 mipmap-xhdpi
   drwxrwxr-x. 2 wagner wagner 4096 ago 11 22:04 mipmap-xxhdpi
   drwxrwxr-x. 2 wagner wagner 4096 ago 11 22:04 mipmap-xxxhdpi
   drwxrwxr-x. 2 wagner wagner 4096 ago 11 22:04 values
   #+end_example


   O que é importante na classe abaixo é conhecer como o android cria
   uma reprensentação em xml da sua activity, os widgets e os layouts.
   #+INCLUDE: projetos/LoginAppJava/app/src/main/res/layout/activity_main.xml :src xml


